ГТС/УТГТС/Documents/АктСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктСверкиВзаиморасчетов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверкаСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительОрганизацииДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительПартнераДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительПартнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымПартнера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/РасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачивается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПоступлению</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупкаПоЗаказу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Comment>Заполняется для поступления товаров и услуг</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалогЗаТару</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСПоставщиком</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОперации</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗачетаПоДатеПлатежа</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСПоставщиком</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорОбъектРасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетовПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерамПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДаннымОбъектаРасчетовИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьЗаказПоставщику</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетовСПоставщиками</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/Documents/АктСверкиВзаиморасчетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	ТекстУсловияПоставщик = "";
	ТекстУсловияКлиент = "";
	ТекстУсловияСоглашение = ?(ЗначениеЗаполнено(Объект.Соглашение), " И Соглашение = &Соглашение", "");
	Если ЗначениеЗаполнено(Объект.ДокументРасчетов) Тогда
		ТекстУсловияКлиент = " И ЗаказКлиента = &ДокументРасчетов";
		ТекстУсловияПоставщик = " И ЗаказПоставщику = &ДокументРасчетов";
		Запрос.УстановитьПараметр("ДокументРасчетов", Объект.ДокументРасчетов);
	КонецЕсли;	
		
	Запрос.Текст = ТекстЗапроса();
	
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НачДата", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("КонДата", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
	
	ОбщийИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбщийИтог.Следующий();
	
	//
	Объект.ОстатокНаНачало = ОбщийИтог.ОстатокНаНачало;
	Объект.ОстатокНаКонец = ОбщийИтог.ОстатокНаКонец;
	Объект.ПоДаннымОрганизации.Очистить();
	
	Выборка = ОбщийИтог.Выбрать();
	
	НомерПП = 0;
	Префикс = Объект.Организация.Префикс;
	Пока Выборка.Следующий() Цикл
		
		НомерПП = НомерПП + 1;
		
		Если Выборка.Регистратор = Неопределено ИЛИ Выборка.Регистратор = null Тогда //Асист-Про - обработка нулл
			Продолжить;
		КонецЕсли;
		
		МетаданныеДокумента = Выборка.Регистратор.Метаданные();
		
		Попытка
			НомерДок = Выборка.Регистратор.НомерВходящегоДокумента;
		Исключение
			НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Регистратор.Номер);
		КонецПопытки;
		
		Если ПустаяСтрока(НомерДок) Тогда
			НомерДок = "________";
		КонецЕсли;
		
		Попытка
			ДатаДок = Выборка.Регистратор.ДатаВходящегоДокумента;
		Исключение
			ДатаДок = Выборка.Регистратор.Дата;
		КонецПопытки;
		
		Если НЕ ЗначениеЗаполнено(ДатаДок) Тогда
			ДатаДок = "________";
		Иначе
			ДатаДок = Формат(ДатаДок, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		//	Если ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") или 
		//		ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
		//		Если Выборка.Регистратор.Соглашение=Объект.Соглашение Тогда
		//			СтрокаТЧ = Объект.ПоДаннымОрганизации.Добавить();
		//			СтрокаТЧ.Дата = Выборка.Регистратор.Дата;
		//			СтрокаТЧ.Документ = Выборка.Регистратор;
		//			СтрокаТЧ.Представление = МетаданныеДокумента.Представление() + " № " + НомерДок + " от " + ДатаДок;
		//			СтрокаТЧ.Дебет = Выборка.Дебет;
		//			СтрокаТЧ.Кредит = Выборка.Кредит;
		//		КонецЕсли;
		//	ИначеЕсли ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.РеализацияТоваровУслуг") или 
		//		ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
		//		СтрокаТЧ = Объект.ПоДаннымОрганизации.Добавить();
		//		СтрокаТЧ.Дата = Выборка.Регистратор.Дата;
		//		СтрокаТЧ.Документ = Выборка.Регистратор;
		//		СтрокаТЧ.Представление = МетаданныеДокумента.Представление() + " № " + НомерДок + " от " + ДатаДок;
		//		СтрокаТЧ.Дебет = Выборка.Дебет;
		//		СтрокаТЧ.Кредит = Выборка.Кредит;
		//	КонецЕсли;
		//Иначе
			СтрокаТЧ = Объект.ПоДаннымОрганизации.Добавить();
			СтрокаТЧ.Дата = Выборка.Регистратор.Дата;
			СтрокаТЧ.Документ = Выборка.Регистратор;
			СтрокаТЧ.Представление = МетаданныеДокумента.Представление() + " № " + НомерДок + " от " + ДатаДок;
			СтрокаТЧ.Дебет = Выборка.Дебет;
			СтрокаТЧ.Кредит = Выборка.Кредит;
			
		//КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры//ЗаполнитьНаСервере()	

&НаСервере
Функция ТекстЗапроса()
	
	Если НЕ ЗначениеЗаполнено(Объект.Соглашение) тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	Вложение.Регистратор,
		|	Вложение.Период,
		|	СУММА(Вложение.ОстатокНаНачало) КАК ОстатокНаНачало,
		|	СУММА(Вложение.Дебет) КАК Дебет,
		|	СУММА(Вложение.Кредит) КАК Кредит,
		|	СУММА(Вложение.ОстатокНаКонец) КАК ОстатокНаКонец
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасчетыСПоставщикамиОстаткиИОбороты.Регистратор КАК Регистратор,
		|		РасчетыСПоставщикамиОстаткиИОбороты.Период КАК Период,
		|		РасчетыСПоставщикамиОстаткиИОбороты.СуммаНачальныйОстаток КАК ОстатокНаНачало,
		|		РасчетыСПоставщикамиОстаткиИОбороты.СуммаРасход КАК Кредит,
		|		РасчетыСПоставщикамиОстаткиИОбороты.СуммаПриход КАК Дебет,
		|		РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток КАК ОстатокНаКонец
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(
		|				&НачДата,
		|				&КонДата,
		|				Регистратор,
		|				,
		|				АналитикаУчетаПоПартнерам В
		|					(ВЫБРАТЬ
		|						АналитикаПоПартнерам.КлючАналитики
		|					ИЗ
		|						РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
		|					ГДЕ
		|						АналитикаПоПартнерам.Партнер = &Партнер
		|						И АналитикаПоПартнерам.Организация = &Организация)) КАК РасчетыСПоставщикамиОстаткиИОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетыСКлиентамиОстаткиИОбороты.Регистратор,
		|		РасчетыСКлиентамиОстаткиИОбороты.Период,
		|		РасчетыСКлиентамиОстаткиИОбороты.СуммаНачальныйОстаток,
		|		РасчетыСКлиентамиОстаткиИОбороты.СуммаРасход,
		|		РасчетыСКлиентамиОстаткиИОбороты.СуммаПриход,
		|		РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(
		|				&НачДата,
		|				&КонДата,
		|				Регистратор,
		|				,
		|				АналитикаУчетаПоПартнерам В
		|					(ВЫБРАТЬ
		|						АналитикаПоПартнерам.КлючАналитики
		|					ИЗ
		|						РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
		|					ГДЕ
		|						АналитикаПоПартнерам.Партнер = &Партнер
		|						И АналитикаПоПартнерам.Организация = &Организация)) КАК РасчетыСКлиентамиОстаткиИОбороты) КАК Вложение
		|
		|СГРУППИРОВАТЬ ПО
		|	Вложение.Период,
		|	Вложение.Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вложение.Период
		|ИТОГИ
		|	СУММА(ОстатокНаНачало),
		|	СУММА(Дебет),
		|	СУММА(Кредит),
		|	СУММА(ОстатокНаКонец)
		|ПО
		|	ОБЩИЕ";
		
	Иначе
		Если ТипЗнч(Объект.Соглашение) = Тип("СправочникСсылка.СоглашенияСПоставщиками") тогда
			Текст =
			"ВЫБРАТЬ
			|	РасчетыСПоставщикамиОстаткиИОбороты.Регистратор КАК Регистратор,
			|	РасчетыСПоставщикамиОстаткиИОбороты.Период КАК Период,
			|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаНачальныйОстаток КАК ОстатокНаНачало,
			|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаРасход КАК Кредит,
			|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаПриход КАК Дебет,
			|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток КАК ОстатокНаКонец
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(
			|			&НачДата,
			|			&КонДата,
			|			Регистратор,
			|			,
			|			АналитикаУчетаПоПартнерам В
			|					(ВЫБРАТЬ
			|						АналитикаПоПартнерам.КлючАналитики
			|					ИЗ
			|						РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
			|					ГДЕ
			|						АналитикаПоПартнерам.Партнер = &Партнер
			|						И АналитикаПоПартнерам.Организация = &Организация)
			|				И Соглашение = &Соглашение) КАК РасчетыСПоставщикамиОстаткиИОбороты
			|ИТОГИ
			|	СУММА(ОстатокНаНачало),
			|	СУММА(Кредит),
			|	СУММА(Дебет),
			|	СУММА(ОстатокНаКонец)
			|ПО
			|	ОБЩИЕ";
		Иначе
			Текст = 
			"ВЫБРАТЬ
			|	РасчетыСКлиентамиОстаткиИОбороты.Соглашение КАК Соглашение,
			|	РасчетыСКлиентамиОстаткиИОбороты.Регистратор,
			|	РасчетыСКлиентамиОстаткиИОбороты.СуммаНачальныйОстаток КАК ОстатокНаНачало,
			|	РасчетыСКлиентамиОстаткиИОбороты.СуммаРасход КАК Кредит,
			|	РасчетыСКлиентамиОстаткиИОбороты.СуммаПриход КАК Дебет,
			|	РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток КАК ОстатокНаКонец
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(
			|			&НачДата,
			|			&КонДата,
			|			Регистратор,
			|			,
			|			АналитикаУчетаПоПартнерам В
			|					(ВЫБРАТЬ
			|						АналитикаПоПартнерам.КлючАналитики
			|					ИЗ
			|						РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
			|					ГДЕ
			|						АналитикаПоПартнерам.Партнер = &Партнер
			|						И АналитикаПоПартнерам.Организация = &Организация)
			|				И Соглашение = &Соглашение) КАК РасчетыСКлиентамиОстаткиИОбороты
			|ИТОГИ
			|	СУММА(ОстатокНаНачало),
			|	СУММА(Кредит),
			|	СУММА(Дебет),
			|	СУММА(ОстатокНаКонец)
			|ПО
			|	ОБЩИЕ";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ПолучитьРевизитОбъектаНаСервере(ИмяОбъектаФормы, ИмяРеквизита)
	
	Возврат Объект[ИмяОбъектаФормы][ИмяРеквизита];
	
КонецФункции//ПолучитьРевизитОбъектаНаСервере(ИмяОбъектаФормы, ИмяРеквизита)	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.ПредставительОрганизацииДолжность = "Главный бухгалтер";
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАктСверки(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры// ЗаполнитьАктСверки

&НаКлиенте
Процедура ДокументРасчетовПриИзменении(Элемент)
	Объект.Организация = ПолучитьРевизитОбъектаНаСервере("ДокументРасчетов", "Организация");
	//Объект.ПредставительОрганизации = ПолучитьРевизитОбъектаНаСервере("Организация", "ТекущийГлавныйБухгалтер");
	ОтветственныеЛица = ПолучитьОтветственныеЛица();
	Объект.ПредставительОрганизации = ОтветственныеЛица.ГлавныйБухгалтер;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	//Объект.ПредставительОрганизации = ПолучитьРевизитОбъектаНаСервере("Организация", "ТекущийГлавныйБухгалтер");
	ОтветственныеЛица = ПолучитьОтветственныеЛица();
	Объект.ПредставительОрганизации = ОтветственныеЛица.ГлавныйБухгалтер;
КонецПроцедуры

//asp+++
&НаСервере
Функция ПолучитьОтветственныеЛица()
	Возврат ОтветственныеЛицаБП.ОтветственныеЛица(Объект.Организация, ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
КонецФункции
//asp---

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//	
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) тогда
		ПоказатьПредупреждение(Неопределено, "Не выбран партнер!");
		возврат;
	КонецЕсли;
	Выбор = Неопределено;

	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СоглашениеВыборИзСпискаЗавершение", ЭтотОбъект), СписокВариантовСоглашений(), Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеВыборИзСпискаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	// 
	
	Выбор = ВыбранныйЭлемент;
	Если Выбор = неопределено тогда возврат конецесли;
	
	Если Выбор.Значение = 0 тогда
		Форма = "Справочник.СоглашенияСКлиентами.ФормаВыбора";
	Иначе
		Форма = "Справочник.СоглашенияСПоставщиками.ФормаВыбора";
	КонецЕсли;
	ОткрытьФорму(Форма, Новый Структура("Партнер, ДатаДокумента", Объект.Партнер, Объект.Дата),,,,, Новый ОписаниеОповещения("ОткрытьФормуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	//
	Выбор = Результат;
	Если НЕ ЗначениеЗаполнено(Выбор) тогда возврат конецесли;
	Объект.Соглашение = Выбор;

КонецПроцедуры

&НаКлиенте
Функция СписокВариантовСоглашений()
	
	Список = Новый СписокЗначений();
	Список.Добавить(0, "Соглашения с клиентами");
	Список.Добавить(1, "Соглашения с поставщиками");
	
	возврат Список;
	
КонецФункции
